ХМНПФ_Общее/Documents/уп_НачислениеПенсийОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_НачислениеПенсийОПС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Доначисление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорыОПС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорОПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗастрахованноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Периодичность</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ПериодичностьВыплат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипПенсииОПС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыПенсийОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПризнакПоследнейВыплаты</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЭтоВосстановлениеЗадолженности</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачислениеЗадолженностиПоПриостановкам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорОПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗастрахованноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Периодичность</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ПериодичностьВыплат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипПенсииОПС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыПенсийОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПризнакПоследнейВыплаты</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПенсионныеПравила.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПенсионныеПравила</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Правопреемники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьПроводкиСводно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПредоставлятьСоциальныйВычет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВсегдаНачислятьЗаПолныйПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РассчитыватьОУДПриЗачислении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьПроводкиСводноОПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВестиРезервВыплатОПСПоДоговорам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВестиРезервВыплатОПСПоТипамСумм</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписыватьТипыСуммПропорционально</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДФЛПравопреемниковОПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтрольНомеровДоговоровОПСГод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Корректировать51СчетПоВидамДеятельности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСклонятьФИОВДокументах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасчетИДОПСпоПриказуФСФР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСписыватьИДРасторженцевОПСПриНачислении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетНачисленияИДПриЗакрытии</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОпределениеКоличестваВыплат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПечататьФИОВЗаявлениях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвращатьСредстваУмершихДоВступленияВДействие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МетодРасчетаРазмещенногоПРДляДекларации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтрольНумерацииДоговоров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ЛицевыеСчетаЗастрахованныхЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ЛицевыеСчетаЗастрахованныхЛиц</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормаВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ФормыВыплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипВыплат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыВыплат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеДействует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗастрахованноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ТипыПенсийОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ТипыПенсийОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Срочная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пожизненная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_НачислениеПенсийОПС/Ext/ObjectModule.bsl
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 31.08.2016 ШадринАВ // ОбработкаПроведения() // №500
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура РасшОбщ_ОбработкаПроведения(Отказ, РежимПроведения)
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
	// Проверка ручной корректировки
	Если уп_ОсновнаяПоставкаСервер.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект,Ложь) Тогда
		Возврат
	КонецЕсли;
	ТабБухУчет = уп_ОбщегоНазначенияУчетРезервов.СформироватьСтруктуруТаблицыБУ();
	ПроводкиПоНачислению = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация)).ПроводкиПоНачислению;
	
	Отказ = Ложь;
	ДатаНачалаУчетаРезервовНачисления = Константы.уп_ДатаНачалаВеденияРезервовНачисления.Получить();
	
	ТабНачислений = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_НачисленияПенсийОПС");
	ТабРезервов = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_РезервыОПС");
	ТабСчетчик = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_СчетчикНачисленийОПС");       
	ТабКонецСВ = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструСведений("уп_НазначеныСрочныеВыплатыОПС");
	ТабЗадолженности = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ЗадолженностьПоПенсиямОПС");
	//ТабДоговоров = ДоговорыОПС.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	уп_НачислениеПенсийОПСДоговорыОПС.ДоговорОПС,
	|	уп_НачислениеПенсийОПСДоговорыОПС.ЗастрахованноеЛицо,
	|	уп_НачислениеПенсийОПСДоговорыОПС.ПериодНачисления,
	|	уп_НачислениеПенсийОПСДоговорыОПС.Периодичность,
	|	уп_НачислениеПенсийОПСДоговорыОПС.Сумма,
	|	уп_НачислениеПенсийОПСДоговорыОПС.ТипПенсииОПС
	|ИЗ
	|	Документ.уп_НачислениеПенсийОПС.ДоговорыОПС КАК уп_НачислениеПенсийОПСДоговорыОПС
	|ГДЕ
	|	уп_НачислениеПенсийОПСДоговорыОПС.Ссылка = &Ссылка
	|	И уп_НачислениеПенсийОПСДоговорыОПС.ТипПенсииОПС = &ТипПенсииОПС";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТипПенсииОПС", Перечисления.уп_ТипыПенсийОПС.Пожизненная);
	
	ТабДоговоров = Запрос.Выполнить().Выгрузить();
	ТабДоговоров.Колонки.Добавить("МожноСписать", Новый ОписаниеТипов("Число"));
	
	//формируем таблицу получателей

	ПенсионныеПравила = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация));
	ЛицевыеСчетаПоТипамВыплат = ПенсионныеПравила.ЛицевыеСчетаПоТипамВыплат;
	Если ЛицевыеСчетаПоТипамВыплат Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ДоговорОПС,
		               |	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.Банк,
		               |	уп_ПолучателиПоДоговорамОбслуживания.ПолучательВПлатежномПоручении,
		               |	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ФормаВыплаты
		               |ПОМЕСТИТЬ ПолучателиНП
		               |ИЗ
		               |	РегистрСведений.уп_ЛицевыеСчетаЗастрахованныхЛиц.СрезПоследних(
		               |			&ДатаДок,
		               |			ДоговорОПС В (&СписокДоговоровОПС)
		               |				И ТипВыплат = &НП) КАК уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПолучателиПоДоговорамОбслуживания КАК уп_ПолучателиПоДоговорамОбслуживания
		               |		ПО уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.Банк = уп_ПолучателиПоДоговорамОбслуживания.Получатель
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ДоговорОПС,
		               |	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.Банк,
		               |	уп_ПолучателиПоДоговорамОбслуживания.ПолучательВПлатежномПоручении,
		               |	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ФормаВыплаты
		               |ПОМЕСТИТЬ ПолучателиСВ
		               |ИЗ
		               |	РегистрСведений.уп_ЛицевыеСчетаЗастрахованныхЛиц.СрезПоследних(
		               |			&ДатаДок,
		               |			ДоговорОПС В (&СписокДоговоровОПС)
		               |				И ТипВыплат = &СВ) КАК уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПолучателиПоДоговорамОбслуживания КАК уп_ПолучателиПоДоговорамОбслуживания
		               |		ПО уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.Банк = уп_ПолучателиПоДоговорамОбслуживания.Получатель
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	уп_НачислениеПенсийОПСДоговорыОПС.ДоговорОПС,
		               |	уп_НачислениеПенсийОПСДоговорыОПС.ТипПенсииОПС
		               |ПОМЕСТИТЬ ДоговорыОПСПоТипам
		               |ИЗ
		               |	Документ.уп_НачислениеПенсийОПС.ДоговорыОПС КАК уп_НачислениеПенсийОПСДоговорыОПС
		               |ГДЕ
		               |	уп_НачислениеПенсийОПСДоговорыОПС.Ссылка = &Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ДоговорыОПСПоТипам.ДоговорОПС,
		               |	ДоговорыОПСПоТипам.ТипПенсииОПС,
		               |	ВЫБОР
		               |		КОГДА ДоговорыОПСПоТипам.ТипПенсииОПС = &Пожизненная
		               |			ТОГДА ПолучателиНП.Банк
		               |		ИНАЧЕ ПолучателиСВ.Банк
		               |	КОНЕЦ КАК Банк,
		               |	ВЫБОР
		               |		КОГДА ДоговорыОПСПоТипам.ТипПенсииОПС = &Пожизненная
		               |			ТОГДА ПолучателиНП.ПолучательВПлатежномПоручении
		               |		ИНАЧЕ ПолучателиСВ.ПолучательВПлатежномПоручении
		               |	КОНЕЦ КАК ПолучательВПлатежномПоручении,
		               |	ВЫБОР
		               |		КОГДА ДоговорыОПСПоТипам.ТипПенсииОПС = &Пожизненная
		               |			ТОГДА ПолучателиНП.ФормаВыплаты
		               |		ИНАЧЕ ПолучателиСВ.ФормаВыплаты
		               |	КОНЕЦ КАК ФормаВыплаты
		               |ИЗ
		               |	ДоговорыОПСПоТипам КАК ДоговорыОПСПоТипам
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ПолучателиНП КАК ПолучателиНП
		               |		ПО ДоговорыОПСПоТипам.ДоговорОПС = ПолучателиНП.ДоговорОПС
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ПолучателиСВ КАК ПолучателиСВ
		               |		ПО ДоговорыОПСПоТипам.ДоговорОПС = ПолучателиСВ.ДоговорОПС";

		Запрос.УстановитьПараметр("ДатаДок", Дата);
		Запрос.УстановитьПараметр("СписокДоговоровОПС", ДоговорыОПС.ВыгрузитьКолонку("ДоговорОПС"));
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Пожизненная", Перечисления.уп_ТипыПенсийОПС.Пожизненная);
		Запрос.УстановитьПараметр("НП", Перечисления.уп_ТипыВыплат.ВыплатыПенсийОПС);
		Запрос.УстановитьПараметр("СВ", Перечисления.уп_ТипыВыплат.СрочнаяПенсияОПС);
	Иначе	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ДоговорОПС,
		|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.Банк,
		|	уп_ПолучателиПоДоговорамОбслуживания.ПолучательВПлатежномПоручении,
		|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ФормаВыплаты
		|ИЗ
		|	РегистрСведений.уп_ЛицевыеСчетаЗастрахованныхЛиц.СрезПоследних(&ДатаДок, ДоговорОПС В (&СписокДоговоровОПС)) КАК уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПолучателиПоДоговорамОбслуживания КАК уп_ПолучателиПоДоговорамОбслуживания
		|		ПО уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.Банк = уп_ПолучателиПоДоговорамОбслуживания.Получатель";
		
		Запрос.УстановитьПараметр("ДатаДок", Дата);
		Запрос.УстановитьПараметр("СписокДоговоровОПС", ДоговорыОПС.ВыгрузитьКолонку("ДоговорОПС"));
	Конецесли;
	
	ТабПолучателей = Запрос.Выполнить().Выгрузить();
	
	//пытаемся списать по договорам пожизненные пенсии
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаДокумента.ДоговорОПС КАК ДоговорОПС,
	               |	ТаблицаДокумента.Сумма КАК Сумма,
	               |	уп_РезервыОПСОстатки.ТипСуммы,
	               |	ЕСТЬNULL(уп_РезервыОПСОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	               |	ТаблицаДокумента.ТипПенсииОПС,
	               |	ЕСТЬNULL(уп_РезервыОПСОстатки.СуммаКомпенсацииОстаток, 0) КАК СуммаКомпенсацииОстаток,
	               |	ЕСТЬNULL(уп_РезервыОПСОстатки.СуммаВосполненияОстаток, 0) КАК СуммаВосполненияОстаток,
	               |	ЕСТЬNULL(уп_РезервыОПСОстатки.СуммаВозмещенияОстаток, 0) КАК СуммаВозмещенияОстаток
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		уп_НачислениеПенсийОПСДоговорыОПС.ДоговорОПС КАК ДоговорОПС,
	               |		уп_НачислениеПенсийОПСДоговорыОПС.ЗастрахованноеЛицо КАК ЗастрахованноеЛицо,
	               |		уп_НачислениеПенсийОПСДоговорыОПС.Периодичность КАК Периодичность,
	               |		СУММА(уп_НачислениеПенсийОПСДоговорыОПС.Сумма) КАК Сумма,
	               |		уп_НачислениеПенсийОПСДоговорыОПС.ТипПенсииОПС КАК ТипПенсииОПС
	               |	ИЗ
	               |		Документ.уп_НачислениеПенсийОПС.ДоговорыОПС КАК уп_НачислениеПенсийОПСДоговорыОПС
	               |	ГДЕ
	               |		уп_НачислениеПенсийОПСДоговорыОПС.Ссылка = &Ссылка
	               |		И уп_НачислениеПенсийОПСДоговорыОПС.ТипПенсииОПС = &ТипПенсииОПС
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		уп_НачислениеПенсийОПСДоговорыОПС.ДоговорОПС,
	               |		уп_НачислениеПенсийОПСДоговорыОПС.ЗастрахованноеЛицо,
	               |		уп_НачислениеПенсийОПСДоговорыОПС.Периодичность,
	               |		уп_НачислениеПенсийОПСДоговорыОПС.ТипПенсииОПС) КАК ТаблицаДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_РезервыОПС.Остатки(
	               |				&ДатаДок,
	               |				Организация = &Организация
	               |					И ТипРезерва = &Выплатной
	               |					И ДоговорОПС В (&СписокДоговоровОПС)) КАК уп_РезервыОПСОстатки
	               |		ПО ТаблицаДокумента.ДоговорОПС = уп_РезервыОПСОстатки.ДоговорОПС
	               |ИТОГИ
	               |	МАКСИМУМ(Сумма),
	               |	СУММА(СуммаОстаток),
	               |	СУММА(СуммаКомпенсацииОстаток),
	               |	СУММА(СуммаВосполненияОстаток),
	               |	СУММА(СуммаВозмещенияОстаток)
	               |ПО
	               |	ДоговорОПС";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаДок", Дата-1);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТипПенсииОПС", Перечисления.уп_ТипыПенсийОПС.Пожизненная);
	Запрос.УстановитьПараметр("СписокДоговоровОПС", ДоговорыОПС.ВыгрузитьКолонку("ДоговорОПС"));
	Запрос.УстановитьПараметр("Выплатной", Перечисления.уп_ТипыРезервовОПС.Выплатной);
	
	Результат = Запрос.Выполнить();
	ВыборкаДоговоров = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	СписыватьПропорционально = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация)).СписыватьТипыСуммПропорционально;
	
	Пока ВыборкаДоговоров.Следующий() Цикл
		//проверим что можно списать по данному договору
		ТекСтрокаТабДоговоров = ТабДоговоров.Найти(ВыборкаДоговоров.ДоговорОПС,"ДоговорОПС");
		Если ВыборкаДоговоров.Сумма<ВыборкаДоговоров.СуммаОстаток Тогда
			СуммаКСписанию = ВыборкаДоговоров.Сумма;
			СуммаОсталось = ВыборкаДоговоров.Сумма;
			Выборка = ВыборкаДоговоров.Выбрать();
			Если СписыватьПропорционально Тогда
				СуммаПролистали = 0;
				Пока Выборка.Следующий() Цикл
					СуммаПролистали = СуммаПролистали+Выборка.СуммаОстаток;
					ТекСуммаКСписанию = Окр(ВыборкаДоговоров.Сумма*Выборка.СуммаОстаток/ВыборкаДоговоров.СуммаОстаток,2,1);
					Если СуммаПролистали = ВыборкаДоговоров.СуммаОстаток Тогда
						ТекСуммаКСписанию = СуммаОсталось;
					КонецЕсли;
					//проверяем
					Если ТекСуммаКСписанию>Выборка.СуммаОстаток-Выборка.СуммаКомпенсацииОстаток-Выборка.СуммаВосполненияОстаток-Выборка.СуммаВозмещенияОстаток Тогда
						СуммаКСписаниюБезКомпенсаций = Выборка.СуммаОстаток-Выборка.СуммаКомпенсацииОстаток-Выборка.СуммаВосполненияОстаток-Выборка.СуммаВозмещенияОстаток;
						СуммаОстаткаКСписанию = СуммаКСписанию-СуммаКСписаниюБезКомпенсаций;
						
						СуммаКомпенсацииКСписанию = Мин(СуммаОстаткаКСписанию, Выборка.СуммаКомпенсацииОстаток);
						СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаКомпенсацииКСписанию;
						
						СуммаВосполненияКСписанию = Мин(СуммаОстаткаКСписанию, Выборка.СуммаВосполненияОстаток);
						СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВосполненияКСписанию;
						
						СуммаВозмещенияКСписанию = Мин(СуммаОстаткаКСписанию, Выборка.СуммаВозмещенияОстаток);
						СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВозмещенияКСписанию;
					Иначе
						СуммаКомпенсацииКСписанию = 0;
						СуммаВосполненияКСписанию = 0;
						СуммаВозмещенияКСписанию = 0;
					КонецЕсли;	
					
					СуммаОсталось = СуммаОсталось - ТекСуммаКСписанию;
					Если ТекСуммаКСписанию<>0 Тогда
						ДвижениеПоРезервамВыплат(Выборка.ДоговорОПС, Выборка.ТипСуммы, ТекСуммаКСписанию, СуммаКомпенсацииКСписанию, СуммаВосполненияКСписанию, СуммаВозмещенияКСписанию);
						ДвижениеПоНачислению(Выборка.ДоговорОПС, Выборка.ТипПенсииОПС, ПериодНачисления, ТекСтрокаТабДоговоров.Периодичность, Выборка.ТипСуммы, ТекСуммаКСписанию, СуммаКомпенсацииКСписанию, СуммаВосполненияКСписанию, СуммаВозмещенияКСписанию, Перечисления.уп_ВидыДвижений.НачислениеПенсийОПС);
					КонецЕсли;
					Если СуммаОсталось = 0 Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
			Иначе
				Пока Выборка.Следующий() Цикл
					Если СуммаОсталось<=Выборка.СуммаОстаток Тогда
						ТекСуммаКСписанию = СуммаОсталось;
						СуммаОсталось = 0;
					Иначе
						ТекСуммаКСписанию = Выборка.СуммаОстаток;
						СуммаОсталось = СуммаОсталось - ТекСуммаКСписанию;
					КонецЕсли;
					Если ТекСуммаКСписанию<>0 Тогда
						//проверяем
						Если ТекСуммаКСписанию>Выборка.СуммаОстаток-Выборка.СуммаКомпенсацииОстаток-Выборка.СуммаВосполненияОстаток-Выборка.СуммаВозмещенияОстаток Тогда
							СуммаКСписаниюБезКомпенсаций = Выборка.СуммаОстаток-Выборка.СуммаКомпенсацииОстаток-Выборка.СуммаВосполненияОстаток-Выборка.СуммаВозмещенияОстаток;
							СуммаОстаткаКСписанию = СуммаКСписанию-СуммаКСписаниюБезКомпенсаций;
							
							СуммаКомпенсацииКСписанию = Мин(СуммаОстаткаКСписанию, Выборка.СуммаКомпенсацииОстаток);
							СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаКомпенсацииКСписанию;
							
							СуммаВосполненияКСписанию = Мин(СуммаОстаткаКСписанию, Выборка.СуммаВосполненияОстаток);
							СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВосполненияКСписанию;
							
							СуммаВозмещенияКСписанию = Мин(СуммаОстаткаКСписанию, Выборка.СуммаВозмещенияОстаток);
							СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВозмещенияКСписанию;
						Иначе
							СуммаКомпенсацииКСписанию = 0;
							СуммаВосполненияКСписанию = 0;
							СуммаВозмещенияКСписанию = 0;
						КонецЕсли;	
						
						ДвижениеПоРезервамВыплат(Выборка.ДоговорОПС, Выборка.ТипСуммы, ТекСуммаКСписанию, СуммаКомпенсацииКСписанию, СуммаВосполненияКСписанию, СуммаВозмещенияКСписанию);
						ДвижениеПоНачислению(Выборка.ДоговорОПС, Выборка.ТипПенсииОПС, ПериодНачисления, ТекСтрокаТабДоговоров.Периодичность, Выборка.ТипСуммы, ТекСуммаКСписанию, СуммаКомпенсацииКСписанию, СуммаВосполненияКСписанию, СуммаВозмещенияКСписанию, Перечисления.уп_ВидыДвижений.НачислениеПенсийОПС);
					КонецЕсли;
					Если СуммаОсталось = 0 Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе
			СуммаКСписанию = ВыборкаДоговоров.СуммаОстаток;
			Выборка = ВыборкаДоговоров.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.СуммаОстаток<>0 Тогда
					//проверяем
					Если СуммаКСписанию>Выборка.СуммаОстаток-Выборка.СуммаКомпенсацииОстаток-Выборка.СуммаВосполненияОстаток-Выборка.СуммаВозмещенияОстаток Тогда
						СуммаКСписаниюБезКомпенсаций = Выборка.СуммаОстаток-Выборка.СуммаКомпенсацииОстаток-Выборка.СуммаВосполненияОстаток-Выборка.СуммаВозмещенияОстаток;
						СуммаОстаткаКСписанию = СуммаКСписанию-СуммаКСписаниюБезКомпенсаций;
						
						СуммаКомпенсацииКСписанию = Мин(СуммаОстаткаКСписанию, Выборка.СуммаКомпенсацииОстаток);
						СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаКомпенсацииКСписанию;
						
						СуммаВосполненияКСписанию = Мин(СуммаОстаткаКСписанию, Выборка.СуммаВосполненияОстаток);
						СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВосполненияКСписанию;
						
						СуммаВозмещенияКСписанию = Мин(СуммаОстаткаКСписанию, Выборка.СуммаВозмещенияОстаток);
						СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВозмещенияКСписанию;
					Иначе
						СуммаКомпенсацииКСписанию = 0;
						СуммаВосполненияКСписанию = 0;
						СуммаВозмещенияКСписанию = 0;
					КонецЕсли;	
					
					ДвижениеПоРезервамВыплат(Выборка.ДоговорОПС, Выборка.ТипСуммы, Выборка.СуммаОстаток, Выборка.СуммаКомпенсацииОстаток, Выборка.СуммаВосполненияОстаток, Выборка.СуммаВозмещенияОстаток);
					ДвижениеПоНачислению(Выборка.ДоговорОПС, Выборка.ТипПенсииОПС, ПериодНачисления, ТекСтрокаТабДоговоров.Периодичность, Выборка.ТипСуммы,  Выборка.СуммаОстаток, Выборка.СуммаКомпенсацииОстаток, Выборка.СуммаВосполненияОстаток, Выборка.СуммаВозмещенияОстаток, Перечисления.уп_ВидыДвижений.НачислениеПенсийОПС);
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
		Если ТекСтрокаТабДоговоров<>Неопределено Тогда
			ТекСтрокаТабДоговоров.МожноСписать = СуммаКСписанию;
		КонецЕсли;
		
	КонецЦикла;
	
	//пытаемся списать без договора по типам сумм
	Если ТабДоговоров.Итог("Сумма")-ТабДоговоров.Итог("МожноСписать")>0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	уп_РезервыОПСОстатки.ТипСуммы,
		               |	ЕСТЬNULL(уп_РезервыОПСОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		               |	ЕСТЬNULL(уп_РезервыОПСОстатки.СуммаКомпенсацииОстаток, 0) КАК СуммаКомпенсацииОстаток,
		               |	ЕСТЬNULL(уп_РезервыОПСОстатки.СуммаВосполненияОстаток, 0) КАК СуммаВосполненияОстаток,
		               |	ЕСТЬNULL(уп_РезервыОПСОстатки.СуммаВозмещенияОстаток, 0) КАК СуммаВозмещенияОстаток
		               |ИЗ
		               |	РегистрНакопления.уп_РезервыОПС.Остатки(
		               |			&ДатаДок,
		               |			Организация = &Организация
		               |				И ТипРезерва = &Выплатной
		               |				И ДоговорОПС = &ПустойДоговорОПС) КАК уп_РезервыОПСОстатки";
		
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ДатаДок", Дата-1);
		Запрос.УстановитьПараметр("ПустойДоговорОПС", Справочники.уп_ДоговорыОПС.ПустаяСсылка());
		Запрос.УстановитьПараметр("Выплатной", Перечисления.уп_ТипыРезервовОПС.Выплатной);
		
		ТабОстатков = Запрос.Выполнить().Выгрузить();
		Если ТабОстатков.Количество()>0 Тогда
			Для каждого ТекСтрокаТабДоговоров из ТабДоговоров Цикл
				Если ТабОстатков.Итог("СуммаОстаток") <= 0 Тогда
					Прервать;
				КонецЕсли;	
				Если ТекСтрокаТабДоговоров.Сумма>ТекСтрокаТабДоговоров.МожноСписать Тогда
					НадоСписать = ТекСтрокаТабДоговоров.Сумма-ТекСтрокаТабДоговоров.МожноСписать;
					СуммаОстаток = ТабОстатков.Итог("СуммаОстаток");
					СуммаОсталось = НадоСписать;
					Если НадоСписать<СуммаОстаток Тогда
						СуммаКСписанию = НадоСписать;
						Если СписыватьПропорционально Тогда
							СуммаПролистали = 0;
							Для Каждого СтрокаТабОстатков из ТабОстатков Цикл
								Если СтрокаТабОстатков.СуммаОстаток>0 Тогда
									СуммаПролистали = СуммаПролистали+СтрокаТабОстатков.СуммаОстаток;
									ТекСуммаКСписанию = Окр(НадоСписать*СтрокаТабОстатков.СуммаОстаток/СуммаОстаток,2,1);
									Если СуммаПролистали = СуммаОстаток Тогда
										ТекСуммаКСписанию = СуммаОсталось;
									КонецЕсли;	
									СуммаОсталось = СуммаОсталось - ТекСуммаКСписанию;
									Если  ТекСуммаКСписанию<>0 Тогда
										//проверяем
										Если ТекСуммаКСписанию>СтрокаТабОстатков.СуммаОстаток-СтрокаТабОстатков.СуммаКомпенсацииОстаток-СтрокаТабОстатков.СуммаВосполненияОстаток-СтрокаТабОстатков.СуммаВозмещенияОстаток Тогда
											СуммаКСписаниюБезКомпенсаций = СтрокаТабОстатков.СуммаОстаток-СтрокаТабОстатков.СуммаКомпенсацииОстаток-СтрокаТабОстатков.СуммаВосполненияОстаток-СтрокаТабОстатков.СуммаВозмещенияОстаток;
											СуммаОстаткаКСписанию = СуммаКСписанию-СуммаКСписаниюБезКомпенсаций;
											
											СуммаКомпенсацииКСписанию = Мин(СуммаОстаткаКСписанию, СтрокаТабОстатков.СуммаКомпенсацииОстаток);
											СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаКомпенсацииКСписанию;
											СтрокаТабОстатков.СуммаКомпенсацииОстаток = СтрокаТабОстатков.СуммаКомпенсацииОстаток-СуммаКомпенсацииКСписанию;
											
											СуммаВосполненияКСписанию = Мин(СуммаОстаткаКСписанию, СтрокаТабОстатков.СуммаВосполненияОстаток);
											СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВосполненияКСписанию;
											СтрокаТабОстатков.СуммаВосполненияОстаток = СтрокаТабОстатков.СуммаВосполненияОстаток-СуммаВосполненияКСписанию;
											
											СуммаВозмещенияКСписанию = Мин(СуммаОстаткаКСписанию, СтрокаТабОстатков.СуммаВозмещенияОстаток);
											СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВозмещенияКСписанию;
											СтрокаТабОстатков.СуммаВозмещенияОстаток = СтрокаТабОстатков.СуммаВозмещенияОстаток-СуммаВозмещенияКСписанию;
										Иначе
											СуммаКомпенсацииКСписанию = 0;
											СуммаВосполненияКСписанию = 0;
											СуммаВозмещенияКСписанию = 0;
										КонецЕсли;	
										
										ДвижениеПоРезервамВыплат(Справочники.уп_ДоговорыОПС.ПустаяСсылка(), СтрокаТабОстатков.ТипСуммы, ТекСуммаКСписанию, СуммаКомпенсацииКСписанию, СуммаВосполненияКСписанию, СуммаВозмещенияКСписанию);
										ДвижениеПоНачислению(ТекСтрокаТабДоговоров.ДоговорОПС, Перечисления.уп_ТипыПенсийОПС.Пожизненная, ПериодНачисления, ТекСтрокаТабДоговоров.Периодичность, СтрокаТабОстатков.ТипСуммы, ТекСуммаКСписанию, СуммаКомпенсацииКСписанию, СуммаВосполненияКСписанию, СуммаВозмещенияКСписанию, Перечисления.уп_ВидыДвижений.НачислениеПенсийОПС);
									КонецЕсли;
									СтрокаТабОстатков.СуммаОстаток = СтрокаТабОстатков.СуммаОстаток-ТекСуммаКСписанию;
									Если СуммаОсталось = 0 Тогда
										Прервать;
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;
						Иначе
							Для Каждого СтрокаТабОстатков из ТабОстатков Цикл
								Если СтрокаТабОстатков.СуммаОстаток>0 Тогда
									Если СуммаОсталось<=СтрокаТабОстатков.СуммаОстаток Тогда
										ТекСуммаКСписанию = СуммаОсталось;
										СуммаОсталось = 0;
									Иначе
										ТекСуммаКСписанию = СтрокаТабОстатков.СуммаОстаток;
										СуммаОсталось = СуммаОсталось - ТекСуммаКСписанию;
									КонецЕсли;
									Если  ТекСуммаКСписанию<>0 Тогда
										//проверяем
										Если ТекСуммаКСписанию>СтрокаТабОстатков.СуммаОстаток-СтрокаТабОстатков.СуммаКомпенсацииОстаток-СтрокаТабОстатков.СуммаВосполненияОстаток-СтрокаТабОстатков.СуммаВозмещенияОстаток Тогда
											СуммаКСписаниюБезКомпенсаций = СтрокаТабОстатков.СуммаОстаток-СтрокаТабОстатков.СуммаКомпенсацииОстаток-СтрокаТабОстатков.СуммаВосполненияОстаток-СтрокаТабОстатков.СуммаВозмещенияОстаток;
											СуммаОстаткаКСписанию = СуммаКСписанию-СуммаКСписаниюБезКомпенсаций;
											
											СуммаКомпенсацииКСписанию = Мин(СуммаОстаткаКСписанию, СтрокаТабОстатков.СуммаКомпенсацииОстаток);
											СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаКомпенсацииКСписанию;
											СтрокаТабОстатков.СуммаКомпенсацииОстаток = СтрокаТабОстатков.СуммаКомпенсацииОстаток-СуммаКомпенсацииКСписанию;
											
											СуммаВосполненияКСписанию = Мин(СуммаОстаткаКСписанию, СтрокаТабОстатков.СуммаВосполненияОстаток);
											СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВосполненияКСписанию;
											СтрокаТабОстатков.СуммаВосполненияОстаток = СтрокаТабОстатков.СуммаВосполненияОстаток-СуммаВосполненияКСписанию;
											
											СуммаВозмещенияКСписанию = Мин(СуммаОстаткаКСписанию, СтрокаТабОстатков.СуммаВозмещенияОстаток);
											СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВозмещенияКСписанию;
											СтрокаТабОстатков.СуммаВозмещенияОстаток = СтрокаТабОстатков.СуммаВозмещенияОстаток-СуммаВозмещенияКСписанию;
										Иначе
											СуммаКомпенсацииКСписанию = 0;
											СуммаВосполненияКСписанию = 0;
											СуммаВозмещенияКСписанию = 0;
										КонецЕсли;	
										
										ДвижениеПоРезервамВыплат(Справочники.уп_ДоговорыОПС.ПустаяСсылка(), СтрокаТабОстатков.ТипСуммы, ТекСуммаКСписанию, СуммаКомпенсацииКСписанию, СуммаВосполненияКСписанию, СуммаВозмещенияКСписанию);
										ДвижениеПоНачислению(ТекСтрокаТабДоговоров.ДоговорОПС, Перечисления.уп_ТипыПенсийОПС.Пожизненная, ПериодНачисления, ТекСтрокаТабДоговоров.Периодичность, СтрокаТабОстатков.ТипСуммы, ТекСуммаКСписанию, СуммаКомпенсацииКСписанию, СуммаВосполненияКСписанию, СуммаВозмещенияКСписанию, Перечисления.уп_ВидыДвижений.НачислениеПенсийОПС);
									Конецесли;
									СтрокаТабОстатков.СуммаОстаток = СтрокаТабОстатков.СуммаОстаток-ТекСуммаКСписанию;
									Если СуммаОсталось = 0 Тогда
										Прервать;
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					Иначе
						СуммаКСписанию = СуммаОстаток;
						Для Каждого СтрокаТабОстатков из ТабОстатков Цикл
							Если СтрокаТабОстатков.СуммаОстаток>0 Тогда
								ТекСуммаКСписанию = СтрокаТабОстатков.СуммаОстаток;
								//проверяем
								Если ТекСуммаКСписанию>СтрокаТабОстатков.СуммаОстаток-СтрокаТабОстатков.СуммаКомпенсацииОстаток-СтрокаТабОстатков.СуммаВосполненияОстаток-СтрокаТабОстатков.СуммаВозмещенияОстаток Тогда
									СуммаКСписаниюБезКомпенсаций = СтрокаТабОстатков.СуммаОстаток-СтрокаТабОстатков.СуммаКомпенсацииОстаток-СтрокаТабОстатков.СуммаВосполненияОстаток-СтрокаТабОстатков.СуммаВозмещенияОстаток;
									СуммаОстаткаКСписанию = СуммаКСписанию-СуммаКСписаниюБезКомпенсаций;
									
									СуммаКомпенсацииКСписанию = Мин(СуммаОстаткаКСписанию, СтрокаТабОстатков.СуммаКомпенсацииОстаток);
									СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаКомпенсацииКСписанию;
									СтрокаТабОстатков.СуммаКомпенсацииОстаток = СтрокаТабОстатков.СуммаКомпенсацииОстаток-СуммаКомпенсацииКСписанию;
									
									СуммаВосполненияКСписанию = Мин(СуммаОстаткаКСписанию, СтрокаТабОстатков.СуммаВосполненияОстаток);
									СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВосполненияКСписанию;
									СтрокаТабОстатков.СуммаВосполненияОстаток = СтрокаТабОстатков.СуммаВосполненияОстаток-СуммаВосполненияКСписанию;
									
									СуммаВозмещенияКСписанию = Мин(СуммаОстаткаКСписанию, СтрокаТабОстатков.СуммаВозмещенияОстаток);
									СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВозмещенияКСписанию;
									СтрокаТабОстатков.СуммаВозмещенияОстаток = СтрокаТабОстатков.СуммаВозмещенияОстаток-СуммаВозмещенияКСписанию;
								Иначе
									СуммаКомпенсацииКСписанию = 0;
									СуммаВосполненияКСписанию = 0;
									СуммаВозмещенияКСписанию = 0;
								КонецЕсли;	
								
								ДвижениеПоРезервамВыплат(Справочники.уп_ДоговорыОПС.ПустаяСсылка(), СтрокаТабОстатков.ТипСуммы, СтрокаТабОстатков.СуммаОстаток, СуммаКомпенсацииКСписанию, СуммаВосполненияКСписанию, СуммаВозмещенияКСписанию);
								ДвижениеПоНачислению(ТекСтрокаТабДоговоров.ДоговорОПС, Перечисления.уп_ТипыПенсийОПС.Пожизненная, ПериодНачисления, ТекСтрокаТабДоговоров.Периодичность, СтрокаТабОстатков.ТипСуммы,  СтрокаТабОстатков.СуммаОстаток, СуммаКомпенсацииКСписанию, СуммаВосполненияКСписанию, СуммаВозмещенияКСписанию, Перечисления.уп_ВидыДвижений.НачислениеПенсийОПС);
								СтрокаТабОстатков.СуммаОстаток = 0;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					ТекСтрокаТабДоговоров.МожноСписать = ТекСтрокаТабДоговоров.МожноСписать+СуммаКСписанию;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
	
	// списываем остатки

	Если ТабДоговоров.Итог("Сумма")-ТабДоговоров.Итог("МожноСписать")>0 Тогда
		
		//проверим пустой остаток
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	СУММА(ЕСТЬNULL(уп_РезервыОПСОстатки.СуммаОстаток, 0)) КАК СуммаОстаток,
		               |	СУММА(ЕСТЬNULL(уп_РезервыОПСОстатки.СуммаКомпенсацииОстаток, 0)) КАК СуммаКомпенсацииОстаток,
		               |	СУММА(ЕСТЬNULL(уп_РезервыОПСОстатки.СуммаВосполненияОстаток, 0)) КАК СуммаВосполненияОстаток,
		               |	СУММА(ЕСТЬNULL(уп_РезервыОПСОстатки.СуммаВозмещенияОстаток, 0)) КАК СуммаВозмещенияОстаток
		               |ИЗ
		               |	РегистрНакопления.уп_РезервыОПС.Остатки(
		               |			&ДатаДок,
		               |			Организация = &Организация
		               |				И ТипРезерва = &Выплатной
		               |				И ДоговорОПС = &ПустойДоговорОПС
		               |				И ТипСуммы = &ПустойТипСуммы) КАК уп_РезервыОПСОстатки";
		
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ДатаДок", Дата-1);
		Запрос.УстановитьПараметр("ПустойДоговорОПС", Справочники.уп_ДоговорыОПС.ПустаяСсылка());
		Запрос.УстановитьПараметр("ПустойТипСуммы", Справочники.уп_ТипыСуммОПС.ПустаяСсылка());
		Запрос.УстановитьПараметр("Выплатной", Перечисления.уп_ТипыРезервовОПС.Выплатной);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			СуммаПустогоОстатка = Выборка.СуммаОстаток;
			СуммаКомпенсацииОстаток = Выборка.СуммаКомпенсацииОстаток;
			СуммаВосполненияОстаток = Выборка.СуммаВосполненияОстаток;
			СуммаВозмещенияОстаток = Выборка.СуммаВозмещенияОстаток;
			Если СуммаПустогоОстатка<0 Тогда
				СуммаПустогоОстатка = 0;
			КонецЕсли;
			Если СуммаКомпенсацииОстаток<0 Тогда
				СуммаКомпенсацииОстаток = 0;
			КонецЕсли;
			Если СуммаВосполненияОстаток<0 Тогда
				СуммаВосполненияОстаток = 0;
			КонецЕсли;
			Если СуммаВозмещенияОстаток<0 Тогда
				СуммаВозмещенияОстаток = 0;
			КонецЕсли;
		Иначе
			СуммаПустогоОстатка = 0;
			СуммаКомпенсацииОстаток = 0;
			СуммаВосполненияОстаток = 0;
			СуммаВозмещенияОстаток = 0;
		КонецЕсли;
		СуммаНедостачи = 0;
		
		Для каждого ТекСтрокаТабДоговоров из ТабДоговоров Цикл
			Если ТекСтрокаТабДоговоров.Сумма>=ТекСтрокаТабДоговоров.МожноСписать Тогда
				Если (ТекСтрокаТабДоговоров.Сумма-ТекСтрокаТабДоговоров.МожноСписать)<СуммаПустогоОстатка Тогда
					ТекСуммаКСписанию = ТекСтрокаТабДоговоров.Сумма-ТекСтрокаТабДоговоров.МожноСписать;
					//проверяем
					Если ТекСуммаКСписанию>СуммаПустогоОстатка-СуммаКомпенсацииОстаток-СуммаВосполненияОстаток-СуммаВозмещенияОстаток Тогда
						СуммаКСписаниюБезКомпенсаций = СуммаПустогоОстатка-СуммаКомпенсацииОстаток-СуммаВосполненияОстаток-СуммаВозмещенияОстаток;
						СуммаОстаткаКСписанию = ТекСуммаКСписанию-СуммаКСписаниюБезКомпенсаций;
						
						СуммаКомпенсацииКСписанию = Мин(СуммаОстаткаКСписанию, СуммаКомпенсацииОстаток);
						СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаКомпенсацииКСписанию;
						СуммаКомпенсацииОстаток = СуммаКомпенсацииОстаток-СуммаКомпенсацииКСписанию;
						
						СуммаВосполненияКСписанию = Мин(СуммаОстаткаКСписанию, СуммаВосполненияОстаток);
						СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВосполненияКСписанию;
						СуммаВосполненияОстаток = СуммаВосполненияОстаток-СуммаВосполненияКСписанию;
						
						СуммаВозмещенияКСписанию = Мин(СуммаОстаткаКСписанию, СуммаВозмещенияОстаток);
						СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВозмещенияКСписанию;
						СуммаВозмещенияОстаток = СуммаВозмещенияОстаток-СуммаВозмещенияКСписанию;
					Иначе
						СуммаКомпенсацииКСписанию = 0;
						СуммаВосполненияКСписанию = 0;
						СуммаВозмещенияКСписанию = 0;
					КонецЕсли;					
					
					ДвижениеПоРезервамВыплат(Справочники.уп_ДоговорыОПС.ПустаяСсылка(), Справочники.уп_ТипыСумм.ПустаяСсылка(), ТекСтрокаТабДоговоров.Сумма-ТекСтрокаТабДоговоров.МожноСписать, СуммаКомпенсацииКСписанию, СуммаВосполненияКСписанию, СуммаВозмещенияКСписанию);
					ДвижениеПоНачислению(ТекСтрокаТабДоговоров.ДоговорОПС, Перечисления.уп_ТипыПенсийОПС.Пожизненная, ПериодНачисления, ТекСтрокаТабДоговоров.Периодичность, Справочники.уп_ТипыСумм.ПустаяСсылка(), ТекСтрокаТабДоговоров.Сумма-ТекСтрокаТабДоговоров.МожноСписать, СуммаКомпенсацииКСписанию, СуммаВосполненияКСписанию, СуммаВозмещенияКСписанию, Перечисления.уп_ВидыДвижений.НачислениеПенсийОПС);
					СуммаПустогоОстатка = СуммаПустогоОстатка-(ТекСтрокаТабДоговоров.Сумма-ТекСтрокаТабДоговоров.МожноСписать);
				Иначе
					СуммаНедостачи = СуммаНедостачи+(ТекСтрокаТабДоговоров.Сумма-ТекСтрокаТабДоговоров.МожноСписать)-СуммаПустогоОстатка;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если СуммаНедостачи>0 Тогда
			Отказ = Истина;
			Сообщить("В выплатном резерве без аналитики недостаточно средств на выплату в размере "+СуммаНедостачи+" руб.",СтатусСообщения.Важное);
			#Вставка
			// +ХМНПФ 31.08.2016 ШадринАВ // ОбработкаПроведения() // №500
			ХМ_ДетализироватьСуммуНедостачиПоДоговорам(ТабДоговоров);
			// -ХМНПФ 31.08.2016 ШадринАВ // ОбработкаПроведения() // №500
			#КонецВставки
     	КонецЕсли;	
	КонецЕсли;	
	
	//записываем счетчик начисления
	Для каждого СтрДоговорыОПС из ДоговорыОПС Цикл
		Если НЕ Доначисление Тогда
			ДвижениеСчетчика(СтрДоговорыОПС.ДоговорОПС,СтрДоговорыОПС.ТипПенсииОПС, 1);
		КонецЕсли;	
	КонецЦикла;	
	
	//списание срочных
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаДокумента.ДоговорОПС КАК ДоговорОПС,
	               |	ТаблицаДокумента.Сумма КАК Сумма,
	               |	ТаблицаДокумента.ТипПенсииОПС,
	               |	уп_РезервыОПСОстатки.ТипСуммы КАК ТипСуммы,
	               |	ЕСТЬNULL(уп_РезервыОПСОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	               |	ТаблицаДокумента.ПризнакПоследнейВыплаты,
	               |	ТаблицаДокумента.Периодичность,
	               |	ЕСТЬNULL(уп_РезервыОПСОстатки.СуммаКомпенсацииОстаток, 0) КАК СуммаКомпенсацииОстаток,
	               |	ЕСТЬNULL(уп_РезервыОПСОстатки.СуммаВосполненияОстаток, 0) КАК СуммаВосполненияОстаток,
	               |	ЕСТЬNULL(уп_РезервыОПСОстатки.СуммаВозмещенияОстаток, 0) КАК СуммаВозмещенияОстаток
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		уп_НачислениеПенсийОПСДоговорыОПС.ДоговорОПС КАК ДоговорОПС,
	               |		уп_НачислениеПенсийОПСДоговорыОПС.ЗастрахованноеЛицо КАК ЗастрахованноеЛицо,
	               |		уп_НачислениеПенсийОПСДоговорыОПС.Периодичность КАК Периодичность,
	               |		СУММА(уп_НачислениеПенсийОПСДоговорыОПС.Сумма) КАК Сумма,
	               |		уп_НачислениеПенсийОПСДоговорыОПС.ТипПенсииОПС КАК ТипПенсииОПС,
	               |		уп_НачислениеПенсийОПСДоговорыОПС.ПризнакПоследнейВыплаты КАК ПризнакПоследнейВыплаты
	               |	ИЗ
	               |		Документ.уп_НачислениеПенсийОПС.ДоговорыОПС КАК уп_НачислениеПенсийОПСДоговорыОПС
	               |	ГДЕ
	               |		уп_НачислениеПенсийОПСДоговорыОПС.Ссылка = &Ссылка
	               |		И уп_НачислениеПенсийОПСДоговорыОПС.ТипПенсииОПС = &ТипПенсииОПС
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		уп_НачислениеПенсийОПСДоговорыОПС.ДоговорОПС,
	               |		уп_НачислениеПенсийОПСДоговорыОПС.ЗастрахованноеЛицо,
	               |		уп_НачислениеПенсийОПСДоговорыОПС.Периодичность,
	               |		уп_НачислениеПенсийОПСДоговорыОПС.ТипПенсииОПС,
	               |		уп_НачислениеПенсийОПСДоговорыОПС.ПризнакПоследнейВыплаты) КАК ТаблицаДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_РезервыОПС.Остатки(
	               |				&ДатаДок,
	               |				Организация = &Организация
	               |					И ТипРезерва = &РезервСрочныхВыплат
	               |					И ДоговорОПС В (&СписокДоговоровОПС)) КАК уп_РезервыОПСОстатки
	               |		ПО ТаблицаДокумента.ДоговорОПС = уп_РезервыОПСОстатки.ДоговорОПС
	               |ИТОГИ
	               |	МАКСИМУМ(Сумма),
	               |	СУММА(СуммаОстаток),
	               |	СУММА(СуммаКомпенсацииОстаток),
	               |	СУММА(СуммаВосполненияОстаток),
	               |	СУММА(СуммаВозмещенияОстаток)
	               |ПО
	               |	ДоговорОПС";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаДок", Дата-1);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТипПенсииОПС", Перечисления.уп_ТипыПенсийОПС.Срочная);
	Запрос.УстановитьПараметр("РезервСрочныхВыплат", Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты);
	Запрос.УстановитьПараметр("СписокДоговоровОПС", ДоговорыОПС.ВыгрузитьКолонку("ДоговорОПС"));
	
	Результат = Запрос.Выполнить();
	ВыборкаДоговоров = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//СписыватьПропорционально = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация)).СписыватьТипыСуммПропорционально;
	
	Пока ВыборкаДоговоров.Следующий() Цикл
		ЭтоПоследняяВыплата = Ложь;
		//проверим что можно списать по данному договору
		//ТекСтрокаТабДоговоров = ТабДоговоров.Найти(ВыборкаДоговоров.ДоговорОПС,"ДоговорОПС");
#Удаление
		Если ВыборкаДоговоров.Сумма<ВыборкаДоговоров.СуммаОстаток Тогда
#КонецУдаления
#Вставка
		// +ХМНПФ 30.07.2020 ШадринАВ // ОбработкаПроведения() // №2866
		Если ВыборкаДоговоров.Сумма <= ВыборкаДоговоров.СуммаОстаток Тогда
		// -ХМНПФ 30.07.2020 ШадринАВ // ОбработкаПроведения() // №2866
#КонецВставки
			СуммаКСписанию = ВыборкаДоговоров.Сумма;
			СуммаОсталось = ВыборкаДоговоров.Сумма;
			Выборка = ВыборкаДоговоров.Выбрать();
			//Если СписыватьПропорционально Тогда
			СуммаПролистали = 0;
			Пока Выборка.Следующий() Цикл
				ЭтоПоследняяВыплата = Выборка.ПризнакПоследнейВыплаты;
				СуммаПролистали = СуммаПролистали+Выборка.СуммаОстаток;
				ТекСуммаКСписанию = Окр(ВыборкаДоговоров.Сумма*Выборка.СуммаОстаток/ВыборкаДоговоров.СуммаОстаток,2,1);
				Если СуммаПролистали = ВыборкаДоговоров.СуммаОстаток Тогда
					ТекСуммаКСписанию = СуммаОсталось;
				КонецЕсли;	
				СуммаОсталось = СуммаОсталось - ТекСуммаКСписанию;
				Если ТекСуммаКСписанию<>0 Тогда
					//проверяем
					Если ТекСуммаКСписанию>Выборка.СуммаОстаток-Выборка.СуммаКомпенсацииОстаток-Выборка.СуммаВосполненияОстаток-Выборка.СуммаВозмещенияОстаток Тогда
						СуммаКСписаниюБезКомпенсаций = Выборка.СуммаОстаток-Выборка.СуммаКомпенсацииОстаток-Выборка.СуммаВосполненияОстаток-Выборка.СуммаВозмещенияОстаток;
						СуммаОстаткаКСписанию = СуммаКСписанию-СуммаКСписаниюБезКомпенсаций;
						
						СуммаКомпенсацииКСписанию = Мин(СуммаОстаткаКСписанию, Выборка.СуммаКомпенсацииОстаток);
						СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаКомпенсацииКСписанию;
						
						СуммаВосполненияКСписанию = Мин(СуммаОстаткаКСписанию, Выборка.СуммаВосполненияОстаток);
						СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВосполненияКСписанию;
						
						СуммаВозмещенияКСписанию = Мин(СуммаОстаткаКСписанию, Выборка.СуммаВозмещенияОстаток);
						СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВозмещенияКСписанию;
					Иначе
						СуммаКомпенсацииКСписанию = 0;
						СуммаВосполненияКСписанию = 0;
						СуммаВозмещенияКСписанию = 0;
					КонецЕсли;	
					
					ДвижениеПоРезервуОПС(Выборка.ДоговорОПС, Выборка.ТипСуммы, ТекСуммаКСписанию, СуммаКомпенсацииКСписанию, СуммаВосполненияКСписанию, СуммаВозмещенияКСписанию);
					ДвижениеПоНачислению(Выборка.ДоговорОПС, Выборка.ТипПенсииОПС, ПериодНачисления, Выборка.Периодичность, Выборка.ТипСуммы, ТекСуммаКСписанию, СуммаКомпенсацииКСписанию, СуммаВосполненияКСписанию, СуммаВозмещенияКСписанию, Перечисления.уп_ВидыДвижений.НачислениеСрочнойПенсииОПС);
				КонецЕсли;
				Если СуммаОсталось = 0 Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			//Иначе
			//	Пока Выборка.Следующий() Цикл
			//		Если СуммаОсталось<=Выборка.СуммаОстаток Тогда
			//			ТекСуммаКСписанию = СуммаОсталось;
			//			СуммаОсталось = 0;
			//		Иначе
			//			ТекСуммаКСписанию = Выборка.СуммаОстаток;
			//			СуммаОсталось = СуммаОсталось - ТекСуммаКСписанию;
			//		КонецЕсли;
			//		Если ТекСуммаКСписанию<>0 Тогда
			//			ДвижениеПоРезервамВыплат(Выборка.ДоговорОПС, Выборка.ТипСуммы, ТекСуммаКСписанию);
			//			ДвижениеПоНачислению(Выборка.ДоговорОПС, Выборка.ТипПенсииОПС, ПериодНачисления, ТекСтрокаТабДоговоров.Периодичность, Выборка.ТипСуммы, ТекСуммаКСписанию);
			//		КонецЕсли;
			//		Если СуммаОсталось = 0 Тогда
			//			Прервать;
			//		КонецЕсли;
			//	КонецЦикла;
			//КонецЕсли;
		Иначе
			уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По договору "+ВыборкаДоговоров.ДоговорОПС+" остаток на счете составляет "+ВыборкаДоговоров.СуммаОстаток+", а начислено "+ВыборкаДоговоров.Сумма,Отказ,Заголовок);
		КонецЕсли;
		
		Если ЭтоПоследняяВыплата Тогда
			//Движение = Движения.уп_НазначеныСрочныеВыплатыОПС.Добавить();
			Движение = ТабКонецСВ.Добавить();
			Движение.Активность = Истина;
			Движение.Период = КонецМесяца(Дата);
			Движение.ДоговорОПС = Выборка.ДоговорОПС;
			Движение.ПризнакСрочнойВыплаты = Ложь;
		КонецЕсли;	
	КонецЦикла;
	
	//расход по регистру задолженности
	//по ТЧ "Список пенсионеров" проверяем наличие остатка в РН npo_НачислениеЗадолженностиПоПриостановкам (соответствие по всем измерениям), списываем его
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_НачислениеПенсийОПСДоговорыОПС.ДоговорОПС КАК ДоговорОПС,
		|	уп_НачислениеПенсийОПСДоговорыОПС.Ссылка.ПериодНачисления КАК ПериодНачисления,
		|	уп_НачислениеПенсийОПСДоговорыОПС.Периодичность КАК Периодичность,
		|	уп_НачислениеПенсийОПСДоговорыОПС.ТипПенсииОПС КАК ТипПенсииОПС,
		|	СУММА(уп_НачислениеПенсийОПСДоговорыОПС.Сумма) КАК Сумма,
		|	МИНИМУМ(уп_НачислениеПенсийОПСДоговорыОПС.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ СписокПенсионеров
		|ИЗ
		|	Документ.уп_НачислениеПенсийОПС.ДоговорыОПС КАК уп_НачислениеПенсийОПСДоговорыОПС
		|ГДЕ
		|	уп_НачислениеПенсийОПСДоговорыОПС.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_НачислениеПенсийОПСДоговорыОПС.ДоговорОПС,
		|	уп_НачислениеПенсийОПСДоговорыОПС.Ссылка.ПериодНачисления,
		|	уп_НачислениеПенсийОПСДоговорыОПС.Периодичность,
		|	уп_НачислениеПенсийОПСДоговорыОПС.ТипПенсииОПС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокПенсионеров.НомерСтроки КАК НомерСтроки,
		|	npo_ЗадолженностьПоПенсиямОстатки.ДоговорОПС КАК ДоговорОПС,
		|	npo_ЗадолженностьПоПенсиямОстатки.НачПериода КАК НачПериода,
		|	npo_ЗадолженностьПоПенсиямОстатки.ПериодичностьВыплат КАК Периодичность,
		|	npo_ЗадолженностьПоПенсиямОстатки.ТипПенсии КАК ТипПенсииОПС,
		|	СписокПенсионеров.Сумма КАК Сумма,
		|	npo_ЗадолженностьПоПенсиямОстатки.СчетчикОстаток КАК СчетчикОстаток,
		|	npo_ЗадолженностьПоПенсиямОстатки.СуммаПенсииОстаток КАК СуммаОстаток,
		|	ПРЕДСТАВЛЕНИЕ(npo_ЗадолженностьПоПенсиямОстатки.ДоговорОПС) КАК НомерСчетаТекст
		|ИЗ
		|	СписокПенсионеров КАК СписокПенсионеров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.уп_ЗадолженностьПоПенсиямОПС.Остатки(
		|				&МоментВремени,
		|				ДоговорОПС В
		|					(ВЫБРАТЬ
		|						СписокПенсионеров.ДоговорОПС КАК ДоговорОПС
		|					ИЗ
		|						СписокПенсионеров КАК СписокПенсионеров)) КАК npo_ЗадолженностьПоПенсиямОстатки
		|		ПО СписокПенсионеров.ДоговорОПС = npo_ЗадолженностьПоПенсиямОстатки.ДоговорОПС
		|			И СписокПенсионеров.ПериодНачисления = npo_ЗадолженностьПоПенсиямОстатки.НачПериода
		|			И СписокПенсионеров.Периодичность = npo_ЗадолженностьПоПенсиямОстатки.ПериодичностьВыплат
		|			И СписокПенсионеров.ТипПенсииОПС = npo_ЗадолженностьПоПенсиямОстатки.ТипПенсии";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СуммаНехватка = Выборка.Сумма - Выборка.СуммаОстаток;
		Если СуммаНехватка > 0 Тогда
			Если СуммаНехватка > 0 Тогда
				ТекстСообщения = "По счету № " + Выборка.НомерСчетаТекст + " сумма превышает сумму задолженности на " + СуммаНехватка + " руб."; 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ДоговорыОПС["+(Выборка.НомерСтроки-1)+"].Сумма", "Объект", Отказ);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		Движение = ТабЗадолженности.Добавить();
		Движение.Активность = Истина;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.ДоговорОПС = Выборка.ДоговорОПС;
		Движение.Период = Дата;
		Движение.НачПериода = Выборка.НачПериода;
		Движение.ПериодичностьВыплат = Выборка.Периодичность;
		Движение.ТипПенсии = Выборка.ТипПенсииОПС;
		Движение.Счетчик = Выборка.СчетчикОстаток;
		Движение.СуммаПенсии = Выборка.Сумма;
	КонецЦикла;	
	
	//приходные движения в РН npo_НачислениеЗадолженностиПоПриостановкам 
	Для каждого стр из НачислениеЗадолженностиПоПриостановкам Цикл
		Движение = ТабЗадолженности.Добавить();
		Движение.Активность = Истина;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.ДоговорОПС = стр.ДоговорОПС;
		Движение.Период = Дата;
		Движение.НачПериода = стр.ПериодНачисления;
		Движение.ПериодичностьВыплат = стр.Периодичность;
		Движение.Счетчик = 1;
		Движение.СуммаПенсии = стр.Сумма;
		Движение.ТипПенсии = стр.ТипПенсииОПС;
	КонецЦикла;	
	
	Движения.уп_НачисленияПенсийОПС.Загрузить(ТабНачислений);
	Движения.уп_РезервыОПС.Загрузить(ТабРезервов);
	Движения.уп_СчетчикНачисленийОПС.Загрузить(ТабСчетчик);
	Движения.уп_НазначеныСрочныеВыплатыОПС.Загрузить(ТабКонецСВ);
	Движения.уп_ЗадолженностьПоПенсиямОПС.Загрузить(ТабЗадолженности);

	Если (ОтражатьВБухгалтерскомУчете и ПроводкиПоНачислению)  Тогда
		уп_ОбщегоНазначенияУчетРезервов.ДополнитьТаблицуБухУчета(Дата, ТабБухУчет, Ссылка, Отказ);
		Если ОтражатьВБухгалтерскомУчете и ПроводкиПоНачислению Тогда
			уп_ОбщегоНазначенияУчетРезервов.СделатьДвиженияПоБухУчету(ЭтотОбъект, ТабБухУчет);
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	//Движения.уп_НачисленияПенсийОПС.Записать();
	//Движения.уп_РезервыВыплатОПС.Записать();
	//Движения.уп_РезервыОПС.Записать();
	//Движения.уп_СчетчикНачисленийОПС.Записать();
	//Движения.Хозрасчетный.Записать();
	
КонецПроцедуры

// ХМНПФ 31.08.2016 ШадринАВ // Новая ХМ_ДетализироватьСуммуНедостачиПоДоговорам() // №500
Процедура ХМ_ДетализироватьСуммуНедостачиПоДоговорам(ТабДоговоров)
	Для каждого стр Из ТабДоговоров Цикл
		Если стр.Сумма > стр.МожноСписать Тогда
			Сообщить("По договору "+стр.ДоговорОПС+" сумма начисления: "+стр.Сумма+", можно списать: "+стр.МожноСписать,СтатусСообщения.Важное);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, Режим, СтрокаТЗ, СтруктураТЧ) Экспорт
	Если НЕ ПРОВЕДЕН Тогда
		#Если Сервер Тогда
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_РезервыОПС);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_НачисленияПенсийОПС);
		#КонецЕсли
		Возврат;	
	КонецЕсли;
	
	СтрокиНаДобавление = СтруктураТЧ.ТЗНачисления.ТЗ.НайтиСтроки(Новый Структура(СтруктураТЧ.ТЗНачисления.Узел.Каспер_поле,СтрокаТЗ[СтруктураТЧ.ТЗНачисления.Узел.Каспер_поле]));
	Для каждого СтрокаТЗ Из СтрокиНаДобавление Цикл
		Движение = Движения.уп_РезервыОПС.ДобавитьРасход();
		Движение.Период = СтрокаТЗ.ДатаВыплаты;
		Движение.Организация = Организация;
		Движение.ДоговорОПС = СтрокаТЗ.ДоговорОПС;
		Движение.ТипРезерва = СтрокаТЗ.ТипРезерва;
		Движение.ТипСуммы = СтрокаТЗ.ТипСуммы;
		Движение.Сумма = СтрокаТЗ.Сумма;
		Движение.Движение = СтрокаТЗ.Движение;//Перечисления.уп_ВидыДвижений.НачислениеПенсийОПС;
		
		Движение = Движения.уп_НачисленияПенсийОПС.ДобавитьПриход();
		Движение.Период = СтрокаТЗ.ДатаВыплаты;
		Движение.ДоговорОПС = СтрокаТЗ.ДоговорОПС;
		Движение.ТипПенсии = СтрокаТЗ.ТипПенсииОПС;
		Движение.НачПериода = СтрокаТЗ.ПериодНачисления;
		Движение.ПериодичностьВыплат = СтрокаТЗ.Периодичность;//Перечисления.уп_ПериодичностьВыплат.Ежемесячно;
		Движение.ТипСуммы = СтрокаТЗ.ТипСуммы;
		Движение.Сумма = СтрокаТЗ.Сумма;
	КонецЦикла;	
	
	#Если Сервер Тогда
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_РезервыОПС);
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_НачисленияПенсийОПС);
	#КонецЕсли
КонецПроцедуры
